tap "homebrew/bundle"
brew "boost"
brew "boost-python3"
brew "cmake"
brew "direnv"
brew "git"
brew "git-lfs"
brew "htop"
brew "sdl2"
brew "starship"
brew "swig"
cask "adguard"
cask "adguard-vpn"
cask "adobe-acrobat-pro"
cask "appcleaner"
cask "arc"
cask "chatgpt"
cask "claude"
cask "discord"
cask "dropbox"
cask "gitkraken"
cask "google-drive"
cask "iterm2"
cask "lm-studio"
cask "mactex-no-gui"
cask "macwhisper"
cask "notion"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-mermaid"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-workspace"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "james-yu.latex-workshop"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liamhammett.inline-parameters"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
